NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include <unity.h>
#include <cmock.h>
#include <string.h>
#include <stdlib.h>

#include "utils.h"
#include "test_assert.h"

#include "bearer_event_mock.h"
#include "device_state_manager.h"
#include "device_state_manager_flash.h"
#include "nrf_mesh_mock.h"
#include "nrf_mesh_externs.h"
#include "nrf_mesh_events_mock.h"
#include "nrf_mesh_keygen_mock.h"
#include "net_state_mock.h"
#include "flash_manager_mock.h"
#include "proxy_mock.h"
#include "mesh_opt_core_mock.h"
#include "manual_mock_queue.h"
#include "mesh_lpn_internal_mock.h"
#include "mesh_lpn_mock.h"
#include "heartbeat_mock.h"
#include "mesh_opt_friend_mock.h"

/* Enable this to check that the handle ordering is as expected (0..N-1). */
#define TEST_EXPLICIT_ORDERING 1
#define VIRTUAL_ADDR           0x8080
#define VIRTUAL_ADDRESS_COUNT  3

#define SUBSCRIPTION_ADDRESS_COUNT_MAX  (DSM_NONVIRTUAL_ADDR_MAX + DSM_VIRTUAL_ADDR_MAX)

/** Non-VLA version of a dsm flash entry */
typedef struct
{
    fm_header_t       header;
    dsm_flash_entry_t entry;
} dsm_entry_t;

MOCK_QUEUE_DEF(fm_entries_read_mock_queue, dsm_entry_t, NULL);

static flash_manager_t * mp_flash_manager;
static uint32_t m_flash_expect_calls;
static flash_manager_page_t m_flash_area[2];
static fm_mem_listener_t * mp_mem_listener;
static uint32_t m_fm_mem_listener_register_expect;
static fm_state_t m_add_manager_result_state;
static struct
{
    bool verify_contents; /**< Verify contents of the flash data. Should be turned off if we're doing batch-operations */
    void * p_data;
    uint32_t data_length;
    uint16_t flash_group;
    uint16_t flash_handle; /**< Expected flash handle if flash group is 0 */
} m_expected_flash_data;


static nrf_mesh_evt_handler_t m_mesh_evt_handler;

static bool m_test_in_friendship;
typedef struct
{
    uint8_t uuid[NRF_MESH_UUID_SIZE];
    uint16_t addr;
    dsm_handle_t handle;
} subman_test_vaddr_info_t;

typedef struct
{
    uint16_t addr;
    dsm_handle_t handle;
} subman_test_addr_info_t;


typedef struct
{
    uint16_t key_index;
    uint8_t nid;
    uint8_t key[NRF_MESH_KEY_SIZE];
    dsm_handle_t handle;

    struct
    {
        nrf_mesh_network_secmat_t net;
        nrf_mesh_beacon_secmat_t beacon;
    } secmat;
} test_net_t;

static uint32_t flash_manager_add_cb(flash_manager_t * p_manager, const flash_manager_config_t * p_config, int calls)
{
    mp_flash_manager = p_manager;
    TEST_ASSERT_EQUAL_PTR(&m_flash_area[0], p_config->p_area);
    TEST_ASSERT_EQUAL(1, p_config->page_count);
    TEST_ASSERT_NOT_NULL(p_config->write_complete_cb);
    TEST_ASSERT_NOT_NULL(p_config->invalidate_complete_cb);
    memcpy(&p_manager->config, p_config, sizeof(flash_manager_config_t));
    p_manager->internal.state = m_add_manager_result_state;
    return NRF_SUCCESS;
}

static void nrf_mesh_evt_handler_add_stub_cb(nrf_mesh_evt_handler_t * p_handler_params, int cmock_num_calls)
{
    (void) cmock_num_calls;
    m_mesh_evt_handler = *p_handler_params;
}

static void helper_trigger_event(nrf_mesh_evt_type_t event_type)
{
    nrf_mesh_evt_t evt;

    switch (event_type)
    {
        case NRF_MESH_EVT_FRIENDSHIP_TERMINATED:
            m_test_in_friendship = false;
            evt.params.friendship_terminated.role = NRF_MESH_FRIENDSHIP_ROLE_LPN;
            break;
        case NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED:
            m_test_in_friendship = true;
            evt.params.friendship_established.role = NRF_MESH_FRIENDSHIP_ROLE_LPN;
            break;
        case NRF_MESH_EVT_LPN_FRIEND_REQUEST_TIMEOUT:
            break;
        default:
            TEST_ASSERT_TRUE(false);
            break;
    }

    evt.type = event_type;
    m_mesh_evt_handler.evt_cb(&evt);
}

void setUp(void)
{
    m_fm_mem_listener_register_expect = 0;
    m_flash_expect_calls = 0;
    nrf_mesh_mock_Init();
    nrf_mesh_keygen_mock_Init();
    flash_manager_mock_Init();
    net_state_mock_Init();
    nrf_mesh_events_mock_Init();
    proxy_mock_Init();
    mesh_opt_core_mock_Init();
    fm_entries_read_mock_queue_Init();
    mesh_lpn_mock_Init();
    mesh_lpn_internal_mock_Init();
    heartbeat_mock_Init();
    mesh_opt_friend_mock_Init();
    mp_flash_manager = NULL;
    m_add_manager_result_state = FM_STATE_READY;
    m_expected_flash_data.verify_contents = true;
    m_expected_flash_data.p_data = NULL;

    bearer_event_critical_section_begin_Ignore();
    bearer_event_critical_section_end_Ignore();
    flash_manager_recovery_page_get_IgnoreAndReturn(&m_flash_area[1]);
    flash_manager_add_StubWithCallback(flash_manager_add_cb);

    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    nrf_mesh_evt_handler_add_ExpectAnyArgs();

    nrf_mesh_evt_handler_add_StubWithCallback(nrf_mesh_evt_handler_add_stub_cb);
    dsm_init();

    /* Ignore the subnet added call by default, it's tested in test_net: */
    nrf_mesh_subnet_added_Ignore();
}

void tearDown(void)
{
    flash_manager_remove_IgnoreAndReturn(NRF_SUCCESS);
    dsm_clear();

    TEST_ASSERT_EQUAL_MESSAGE(0, m_flash_expect_calls, "Not all expected flash operations called");
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    nrf_mesh_keygen_mock_Verify();
    nrf_mesh_keygen_mock_Destroy();
    flash_manager_mock_Verify();
    flash_manager_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    nrf_mesh_events_mock_Verify();
    nrf_mesh_events_mock_Destroy();
    mesh_opt_core_mock_Verify();
    mesh_opt_core_mock_Destroy();
    proxy_mock_Verify();
    proxy_mock_Destroy();
    fm_entries_read_mock_queue_Verify();
    fm_entries_read_mock_queue_Destroy();
    mesh_lpn_mock_Verify();
    mesh_lpn_mock_Destroy();
    mesh_lpn_internal_mock_Verify();
    mesh_lpn_internal_mock_Destroy();
    heartbeat_mock_Verify();
    heartbeat_mock_Destroy();
    mesh_opt_friend_mock_Verify();
    mesh_opt_friend_mock_Destroy();
}

static void flash_manager_mem_listener_register_cb(fm_mem_listener_t * p_listener, int calls)
{
    TEST_ASSERT_NOT_EQUAL(0, m_fm_mem_listener_register_expect);
    m_fm_mem_listener_register_expect--;
    mp_mem_listener = p_listener;
}


