NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
static void flash_get_multiple_expect(dsm_entry_t *        p_entries,
                                      uint32_t             entry_count)
{
    flash_manager_entries_read_StubWithCallback(flash_manager_entries_read_mock_callback);
    for (uint32_t i = 0; i < entry_count; i++)
    {
        fm_entries_read_mock_queue_Expect(&p_entries[i]);
    }
}

static void network_add(test_net_t * p_test_net)
{
    p_test_net->secmat.net.nid = p_test_net->nid;
    memset(p_test_net->secmat.net.privacy_key, p_test_net->key_index | 0xA0, NRF_MESH_KEY_SIZE);
    memset(p_test_net->secmat.net.encryption_key, p_test_net->key_index | 0xB0, NRF_MESH_KEY_SIZE);
    nrf_mesh_keygen_network_secmat_ExpectAndReturn(p_test_net->key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&p_test_net->secmat.net, sizeof(p_test_net->secmat.net));

    memset(p_test_net->secmat.beacon.net_id, p_test_net->key_index | 0xC0, NRF_MESH_NETID_SIZE);
    memset(p_test_net->secmat.beacon.key, p_test_net->key_index | 0xD0, NRF_MESH_KEY_SIZE);
    nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(p_test_net->key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&p_test_net->secmat.beacon, sizeof(p_test_net->secmat.beacon));

#if MESH_FEATURE_GATT_PROXY_ENABLED
    memset(p_test_net->secmat.beacon.identity_key, p_test_net->key_index | 0xE0, NRF_MESH_KEY_SIZE);
    nrf_mesh_keygen_identitykey_ExpectAndReturn(p_test_net->key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_identitykey_IgnoreArg_p_key();
    nrf_mesh_keygen_identitykey_ReturnMemThruPtr_p_key(p_test_net->secmat.beacon.identity_key, NRF_MESH_KEY_SIZE);
#endif
    uint8_t net_key[NRF_MESH_KEY_SIZE];
    memset(net_key, 0xFF, NRF_MESH_KEY_SIZE);
    flash_expect_subnet(p_test_net->key, p_test_net->key_index);
    nrf_mesh_subnet_added_Expect(p_test_net->key_index, p_test_net->secmat.beacon.net_id);

    /* add the net */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(p_test_net->key_index, p_test_net->key, &p_test_net->handle));
    TEST_ASSERT_NOT_EQUAL(DSM_HANDLE_INVALID, p_test_net->handle);
    TEST_ASSERT_NOT_EQUAL(0xABCD, p_test_net->handle); /* The handle must have changed */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_key_get(p_test_net->handle, net_key));
    TEST_ASSERT_EQUAL_HEX8_ARRAY(p_test_net->key, net_key, NRF_MESH_KEY_SIZE);
}

static void friendship_network_add(test_net_t * p_net,
                                   nrf_mesh_keygen_friendship_secmat_params_t * p_frnd_secmat_params,
                                   nrf_mesh_network_secmat_t * p_frnd_secmat)
{
    const nrf_mesh_network_secmat_t * p_net_secmat_valid;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(p_net->key_index, &p_net_secmat_valid));

    nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(p_net->key, p_frnd_secmat_params, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(p_frnd_secmat, sizeof(nrf_mesh_network_secmat_t));

    TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid, p_frnd_secmat_params));
}

static void subnet_key_refresh_phase_Verify(dsm_handle_t subnet_handle,
                                            nrf_mesh_key_refresh_phase_t expected_phase)
{
        /* Verify the changed key: */
    nrf_mesh_key_refresh_phase_t kr_phase;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(subnet_handle, &kr_phase));
    TEST_ASSERT_EQUAL(expected_phase, kr_phase);
}

static void nid_key_refresh_phase_Verify(uint8_t nid,
                                         nrf_mesh_key_refresh_phase_t expected_phase)
{
    /* Fetch secmat to get the key refresh phase.  */
    const nrf_mesh_network_secmat_t * p_primary_secmat = NULL;
    const nrf_mesh_network_secmat_t * p_secondary_secmat = NULL;
    nrf_mesh_net_secmat_next_get(nid, &p_primary_secmat, &p_secondary_secmat);
    if (p_primary_secmat != NULL)
    {
        TEST_ASSERT_EQUAL(expected_phase, nrf_mesh_key_refresh_phase_get(p_primary_secmat));
    }
    else if (p_secondary_secmat != NULL)
    {
        TEST_ASSERT_EQUAL(expected_phase, nrf_mesh_key_refresh_phase_get(p_secondary_secmat));
    }
    else
    {
        char msg[64];
        (void) sprintf(msg, "Neither primary or secondary secmat matched NID %#x", nid);
        TEST_FAIL_MESSAGE(msg);
    }
}

static void friendship_key_refresh_phase_Verify(uint16_t lpn_address,
                                                nrf_mesh_key_refresh_phase_t expected_phase)
{
    const nrf_mesh_network_secmat_t * p_friendship_secmat = NULL;
    nrf_mesh_friendship_secmat_get(lpn_address, &p_friendship_secmat);
    TEST_ASSERT_NOT_NULL(p_friendship_secmat);
    TEST_ASSERT_EQUAL(expected_phase, nrf_mesh_key_refresh_phase_get(p_friendship_secmat));
}

/*****************************************************************************
* Tests
*****************************************************************************/

void test_addresses(void)
{
    /* local unicast */
    dsm_local_unicast_address_t unicast_get;

    dsm_local_unicast_addresses_get(&unicast_get);
    TEST_ASSERT_EQUAL(NRF_MESH_ADDR_UNASSIGNED, unicast_get.address_start);
    TEST_ASSERT_EQUAL(0, unicast_get.count);

    dsm_local_unicast_address_t unicast = { 0x0000, 1};
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_DATA, dsm_local_unicast_addresses_set(&unicast));
    unicast.address_start = 0xF000;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_DATA, dsm_local_unicast_addresses_set(&unicast));
    unicast.address_start = 0x8000;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_DATA, dsm_local_unicast_addresses_set(&unicast));
    unicast.address_start = 0x0002;
    unicast.count = 0x8000;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_DATA, dsm_local_unicast_addresses_set(&unicast));
    unicast.count = 0x0000;
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_DATA, dsm_local_unicast_addresses_set(&unicast));
    dsm_local_unicast_addresses_get(&unicast_get);
    TEST_ASSERT_EQUAL(NRF_MESH_ADDR_UNASSIGNED, unicast_get.address_start);
    TEST_ASSERT_EQUAL(0, unicast_get.count);
    unicast.count = 0x0003;
    flash_expect_unicast(&unicast);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_local_unicast_addresses_set(&unicast));
    dsm_local_unicast_addresses_get(&unicast_get);
    TEST_ASSERT_EQUAL(2, unicast_get.address_start);
    TEST_ASSERT_EQUAL(3, unicast_get.count);

