NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    const nrf_mesh_network_secmat_t *p_net_secmat_valid[2];
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(net[0].key_index, &p_net_secmat_valid[0]));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(net[1].key_index, &p_net_secmat_valid[1]));

    nrf_mesh_network_secmat_t net_secmat_unknown;
    net_secmat_unknown.nid = 0x51;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, nrf_mesh_friendship_secmat_params_set(&net_secmat_unknown,  &friendship_secmat_params[0]));

    /* NOTE: Friendship secmat NID is chosen differently from normal secmat. */
    nrf_mesh_network_secmat_t friendship_secmat =
    {
        .nid = 0x7f,
        .privacy_key = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0F},
        .encryption_key = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0F},
    };
    nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(net[0].key, &friendship_secmat_params[0], NULL, NRF_SUCCESS);
    nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&friendship_secmat, sizeof(nrf_mesh_network_secmat_t));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid[0], &friendship_secmat_params[0]));

    /**** Delete ****/
    uint8_t delete_indexes[] = {0, 8};
    for (uint32_t i = 0; i < sizeof(delete_indexes); i++)
    {
        flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_SUBNETS, net[delete_indexes[i]].handle));
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_delete(net[delete_indexes[i]].handle));
        net[delete_indexes[i]].in_the_list = false;
    }
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_delete(0x8888));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_delete(DSM_HANDLE_INVALID));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_delete(net[delete_indexes[0]].handle));      /* already deleted */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update(net[delete_indexes[0]].handle, key)); /* already deleted */

    /**** Re-add ****/
    /* since we've deleted a couple, we should be able to add some more again */
    uint8_t readd_indexes[] = {
        3, /* the one that was rejected for having the same index as net[0], which has been deleted */
        11, /* The one that was rejected because we were full */
    };
    for (uint32_t i = 0; i < sizeof(readd_indexes); i++)
    {
        net_secmat.nid = net[readd_indexes[i]].nid;

        /* expected keygen calls */
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(net[readd_indexes[i]].key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&net_secmat, sizeof(net_secmat));

        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(net[readd_indexes[i]].key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&beacon_secmat, sizeof(beacon_secmat));

#if MESH_FEATURE_GATT_PROXY_ENABLED
        nrf_mesh_keygen_identitykey_ExpectAndReturn(net[readd_indexes[i]].key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_identitykey_IgnoreArg_p_key();
        nrf_mesh_keygen_identitykey_ReturnMemThruPtr_p_key(identity_key, NRF_MESH_KEY_SIZE);
#endif
        nrf_mesh_subnet_added_Expect(net[readd_indexes[i]].key_index, beacon_secmat.net_id);

        flash_expect_subnet(net[readd_indexes[i]].key, net[readd_indexes[i]].key_index);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(net[readd_indexes[i]].key_index, net[readd_indexes[i]].key, &net[readd_indexes[i]].handle));
        TEST_ASSERT_NOT_EQUAL(DSM_HANDLE_INVALID, net[readd_indexes[i]].handle);
        TEST_ASSERT_NOT_EQUAL(0xABCD, net[readd_indexes[i]].handle); /* The handle must have changed */
        net[readd_indexes[i]].in_the_list = true;
    }

    friendship_secmat.nid--;
    /* Now it shall be possible to add friendship creds again */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(net[3].key_index, &p_net_secmat_valid[0]));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(net[11].key_index, &p_net_secmat_valid[1]));
    nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(net[3].key, &friendship_secmat_params[0], NULL, NRF_SUCCESS);
    nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&friendship_secmat, sizeof(nrf_mesh_network_secmat_t));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid[0], &friendship_secmat_params[0]));

    /* Remove friendship creds */
    nrf_mesh_evt_t mesh_friendship_terminated_evt;
    mesh_friendship_terminated_evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
    mesh_friendship_terminated_evt.params.friendship_terminated.lpn_src = friendship_secmat_params[0].lpn_address;
    mesh_friendship_terminated_evt.params.friendship_terminated.friend_src = friendship_secmat_params[0].friend_address;
    m_mesh_evt_handler.evt_cb(&mesh_friendship_terminated_evt);

    /* Add friendship creds again */
    nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(net[3].key, &friendship_secmat_params[0], NULL, NRF_SUCCESS);
    nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&friendship_secmat, sizeof(nrf_mesh_network_secmat_t));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid[0], &friendship_secmat_params[0]));

    /**** Friendship Secmat Get ****/
    const nrf_mesh_network_secmat_t * p_secmat = NULL;
    const nrf_mesh_network_secmat_t * p_aux_secmat = NULL;

    /* Ask with p_secmat eq to NULL */
    nrf_mesh_net_secmat_next_get(friendship_secmat.nid, &p_secmat, &p_aux_secmat);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(&friendship_secmat, p_secmat, sizeof(nrf_mesh_network_secmat_t));
    TEST_ASSERT_NULL(p_aux_secmat);

    /* Remove friendship creds to not interfere with rest of the test */
    m_mesh_evt_handler.evt_cb(&mesh_friendship_terminated_evt);

    /**** Get ****/
    uint32_t count = ARRAY_SIZE(net);
    bool found_keys[ARRAY_SIZE(net)];
    memset(found_keys, 0, sizeof(found_keys));
    mesh_key_index_t key_indexes[ARRAY_SIZE(net)];
    memset(key_indexes, 0xAB, sizeof(key_indexes));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_get_all(key_indexes, &count));

    uint32_t found_key_count = 0;
    for (uint32_t i = 0; i < count; i++)
    {
        for (uint32_t j = 0; j < ARRAY_SIZE(net); j++)
        {
            if (net[j].key_index == key_indexes[i] && net[j].in_the_list)
            {
                TEST_ASSERT_FALSE(found_keys[j]);
                found_key_count++;

