NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    /* Add some dummy networks */
    struct
    {
        dsm_handle_t handle;
        nrf_mesh_network_secmat_t secmat;
        nrf_mesh_beacon_info_t beacon_info;
    } net[3];
    uint8_t key[NRF_MESH_KEY_SIZE] = {};
    for (uint32_t i = 0; i < ARRAY_SIZE(net); i++)
    {
        memset(net[i].secmat.privacy_key, i, NRF_MESH_KEY_SIZE);
        memset(net[i].secmat.encryption_key, i + 0x10, NRF_MESH_KEY_SIZE);
        memset(net[i].beacon_info.secmat.key, i + 0x20, NRF_MESH_KEY_SIZE);
        memset(net[i].beacon_info.secmat.net_id, i + 0x30, NRF_MESH_NETID_SIZE);
        net[i].secmat.nid = i;
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&net[i].secmat, sizeof(net[i].secmat));
        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&net[i].beacon_info.secmat, sizeof(net[i].beacon_info.secmat));
        flash_expect_subnet(key, i);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(i, key, &net[i].handle));
    }
    /* Add some dummy apps */
    struct
    {
        dsm_handle_t handle;
        uint8_t aid;
    } app[6];
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_keygen_aid_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_aid_IgnoreArg_p_aid();
        nrf_mesh_keygen_aid_ReturnMemThruPtr_p_aid(&app[i].aid, sizeof(app[i].aid));
        flash_expect_appkey(key, i, net[i / 2].handle);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_add(i, net[i / 2].handle, key, &app[i].handle));
    }
    /* Add some dummy device keys */
    struct
    {
        uint16_t owner;
        dsm_handle_t handle;
        uint8_t key[NRF_MESH_KEY_SIZE];
    } dev[4];
    for (uint32_t i = 0; i < ARRAY_SIZE(dev); i++)
    {
        dev[i].owner = i + 0x1000;
        memset(dev[i].key, i, NRF_MESH_KEY_SIZE);
        flash_expect_devkey(dev[i].key, dev[i].owner, net[0].handle);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_devkey_add(dev[i].owner, net[0].handle, dev[i].key, &dev[i].handle));
    }

    /* Add some dummy friendships */
    struct
    {
        mesh_key_index_t key_index;
        dsm_handle_t subnet_handle;
        nrf_mesh_keygen_friendship_secmat_params_t secmat_params;
        nrf_mesh_network_secmat_t secmat;
    } friendships[] =
    {
        {0, 0, {0x0001, 0x0002, 1, 2}, {0, {0xAA}, {0xBB}}},
    };
    for (uint32_t i = 0; i < ARRAY_SIZE(friendships); i++)
    {
        const nrf_mesh_network_secmat_t *p_net_secmat_valid;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(friendships[i].key_index, &p_net_secmat_valid));

        nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(key, &friendships[i].secmat_params, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&friendships[i].secmat, sizeof(nrf_mesh_network_secmat_t));

        TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid, &friendships[i].secmat_params));
    }

    /* Once all keys are added, check against invalid params */
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[0].handle, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_tx_secmat_get(DSM_HANDLE_INVALID, DSM_APP_MAX + DSM_DEVICE_MAX, &secmat));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_tx_secmat_get(DSM_HANDLE_INVALID, DSM_HANDLE_INVALID, &secmat));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, app[0].handle, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, DSM_APP_MAX + DSM_DEVICE_MAX, &secmat));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, DSM_HANDLE_INVALID, &secmat));

    /* Get tx secmats for apps */
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));
        TEST_ASSERT_NOT_NULL(secmat.p_net);
        TEST_ASSERT_NOT_NULL(secmat.p_app);

        TEST_ASSERT_EQUAL_MEMORY(&net[i / 2].secmat, secmat.p_net, sizeof(nrf_mesh_network_secmat_t));
        TEST_ASSERT_EQUAL_HEX8_ARRAY(key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL(app[i].aid, secmat.p_app->aid);
        TEST_ASSERT_EQUAL(false, secmat.p_app->is_device_key);

        /* Also get tx secmat for friendship */
        for (uint32_t j = 0; j < ARRAY_SIZE(friendships); j++)
        {
            if (friendships[j].subnet_handle == net[i / 2].handle)
            {
                TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));

                TEST_ASSERT_EQUAL_MEMORY(&friendships[j].secmat, secmat.p_net, sizeof(nrf_mesh_network_secmat_t));
                TEST_ASSERT_EQUAL_HEX8_ARRAY(key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
                TEST_ASSERT_EQUAL(app[i].aid, secmat.p_app->aid);
                TEST_ASSERT_EQUAL(false, secmat.p_app->is_device_key);
            }
        }
    }

    /* Get tx secmats for devkeys */
    for (uint32_t i = 0; i < ARRAY_SIZE(dev); i++)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, dev[i].handle, &secmat));
        TEST_ASSERT_NOT_NULL(secmat.p_net);
        TEST_ASSERT_NOT_NULL(secmat.p_app);

        TEST_ASSERT_EQUAL_MEMORY(&net[0].secmat, secmat.p_net, sizeof(nrf_mesh_network_secmat_t));
        TEST_ASSERT_EQUAL_HEX8_ARRAY(dev[i].key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL(0, secmat.p_app->aid);
        TEST_ASSERT_EQUAL(true, secmat.p_app->is_device_key);
    }
    /* Delete a devkey, ensure we can't get a secmat for it anymore. */
    flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_DEVKEYS, dev[0].handle - DSM_APP_MAX));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_devkey_delete(dev[0].handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_tx_secmat_get(DSM_HANDLE_INVALID, dev[0].handle, &secmat));

    /* get beacon info structures */
    const nrf_mesh_beacon_info_t * p_beacon_info = NULL;
    for (uint32_t i = 0; i < ARRAY_SIZE(net); i++)
    {
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_beacon_info_get(net[i].handle, &p_beacon_info));
        TEST_ASSERT_EQUAL_MEMORY(&net[i].beacon_info.secmat, &p_beacon_info->secmat, sizeof(nrf_mesh_beacon_secmat_t));
    }
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_beacon_info_get(ARRAY_SIZE(net), &p_beacon_info));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_beacon_info_get(0x8888, &p_beacon_info));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, dsm_beacon_info_get(0, NULL));

