NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    /* No more networks, should now get NULL back. */
    nrf_mesh_beacon_info_next_get(NULL, &p_beacon_info, &kr_phase);
    TEST_ASSERT_EQUAL_PTR(NULL, p_beacon_info);

    /* Get with NetID filters: */
    p_beacon_info = NULL;
    nrf_mesh_beacon_info_next_get(net[0].beacon_secmat.net_id, &p_beacon_info, &kr_phase);
    TEST_ASSERT_NOT_NULL(p_beacon_info);
    TEST_ASSERT_EQUAL_MEMORY(&net[0].beacon_secmat, &p_beacon_info->secmat, sizeof(nrf_mesh_beacon_secmat_t));
    /* Since the last network has the same network ID as the first, we should
     * get that one on the next iteration (but skip the one with a different
     * NetID) */
    nrf_mesh_beacon_info_next_get(net[0].beacon_secmat.net_id, &p_beacon_info, &kr_phase);
    TEST_ASSERT_NOT_NULL(p_beacon_info);
    TEST_ASSERT_EQUAL_MEMORY(&net[2].beacon_secmat, &p_beacon_info->secmat, sizeof(nrf_mesh_beacon_secmat_t));

    /* No more networks with a matching NetID, should now get NULL back. */
    nrf_mesh_beacon_info_next_get(net[0].beacon_secmat.net_id, &p_beacon_info, &kr_phase);
    TEST_ASSERT_EQUAL_PTR(NULL, p_beacon_info);

    /* Get the unique Net ID */
    p_beacon_info = NULL;
    nrf_mesh_beacon_info_next_get(net[1].beacon_secmat.net_id, &p_beacon_info, &kr_phase);
    TEST_ASSERT_NOT_NULL(p_beacon_info);
    TEST_ASSERT_EQUAL_MEMORY(&net[1].beacon_secmat, &p_beacon_info->secmat, sizeof(nrf_mesh_beacon_secmat_t));

    /* No more networks with a matching NetID, should now get NULL back. */
    nrf_mesh_beacon_info_next_get(net[1].beacon_secmat.net_id, &p_beacon_info, &kr_phase);
    TEST_ASSERT_EQUAL_PTR(NULL, p_beacon_info);

    /* Get non-existing NetID, no results. */
    uint8_t dummy_net_id[NRF_MESH_NETID_SIZE];
    memset(dummy_net_id, 0xFE, NRF_MESH_NETID_SIZE);
    p_beacon_info = NULL;
    nrf_mesh_beacon_info_next_get(dummy_net_id, &p_beacon_info, &kr_phase);
    TEST_ASSERT_EQUAL_PTR(NULL, p_beacon_info);

    TEST_NRF_MESH_ASSERT_EXPECT(nrf_mesh_beacon_info_next_get(NULL, NULL, NULL));
}

void test_address_subcount_regular(void)
{
    uint16_t count = 0xffff;
    dsm_handle_t address_handle;
    mesh_lpn_is_in_friendship_IgnoreAndReturn(m_test_in_friendship);
    flash_expect_addr_nonvirtual(0xc442);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add(0xc442, &address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(address_handle, &count));
    TEST_ASSERT_EQUAL_UINT16(1, count);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add(0xc442, &address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(address_handle, &count));
    TEST_ASSERT_EQUAL_UINT16(2, count);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_remove(address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(address_handle, &count));
    TEST_ASSERT_EQUAL_UINT16(1, count);

    flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_NONVIRTUAL, address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_remove(address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_address_subscription_count_get(address_handle, &count));

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_address_subscription_remove(address_handle));
}

void test_address_subcount_virtual(void)
{
    const uint8_t virtual_uuid[] = { 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15 };
    uint16_t virtual_address = 0xabcd; /* This is not the actual address corresponding to the above UUID */
    dsm_handle_t address_handle;
    uint16_t count = 0xffff;

    mesh_lpn_is_in_friendship_IgnoreAndReturn(m_test_in_friendship);
    nrf_mesh_keygen_virtual_address_ExpectAndReturn(virtual_uuid, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
    nrf_mesh_keygen_virtual_address_ReturnThruPtr_p_address(&virtual_address);
    flash_expect_addr_virtual(virtual_uuid);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_virtual_add(virtual_uuid, &address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(address_handle, &count));
    TEST_ASSERT_EQUAL_UINT16(1, count);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add_handle(address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(address_handle, &count));
    TEST_ASSERT_EQUAL_UINT16(2, count);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_remove(address_handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(address_handle, &count));
    TEST_ASSERT_EQUAL_UINT16(1, count);

    flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_VIRTUAL, address_handle - DSM_NONVIRTUAL_ADDR_MAX));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_remove(address_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_address_subscription_count_get(address_handle, &count));

    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_address_subscription_remove(address_handle));
}


void test_subscription_propagation_to_friend(void)
{
    subman_test_addr_info_t exp_nv_addr[DSM_NONVIRTUAL_ADDR_MAX];
    subman_test_vaddr_info_t exp_vt_addr[DSM_VIRTUAL_ADDR_MAX];
    uint16_t nv_cnt = 0;
    uint16_t vt_cnt = 0;

    memset(exp_nv_addr, 0, sizeof(exp_nv_addr));
    memset(exp_vt_addr, 0, sizeof(exp_vt_addr));
    printf("DSM_NONVIRTUAL_ADDR_MAX: %d DSM_VIRTUAL_ADDR_MAX: %d\n", DSM_NONVIRTUAL_ADDR_MAX, DSM_VIRTUAL_ADDR_MAX);

    /* Test: DSM propagates existing addresses to the subscription manager once friendship is established */
    for (uint32_t i = 0; i < DSM_NONVIRTUAL_ADDR_MAX - 1; i++)
    {
        exp_nv_addr[nv_cnt].addr = 0xC000 + i;
        flash_expect_addr_nonvirtual(exp_nv_addr[nv_cnt].addr);
        mesh_lpn_is_in_friendship_ExpectAndReturn(m_test_in_friendship);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add(exp_nv_addr[nv_cnt].addr, &exp_nv_addr[nv_cnt].handle));

        /* Add some addresses multiple times */
        if (i % 2)
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add(exp_nv_addr[nv_cnt].addr, &exp_nv_addr[nv_cnt].handle));
        }
        nv_cnt++;
    }

    mesh_lpn_internal_mock_Verify();
    for (uint32_t i = 0; i < DSM_VIRTUAL_ADDR_MAX - 1; i++)
    {
        exp_vt_addr[vt_cnt].addr = 0xA000 + vt_cnt;
        memset(exp_vt_addr[vt_cnt].uuid, vt_cnt, NRF_MESH_UUID_SIZE);

        mesh_lpn_is_in_friendship_ExpectAndReturn(m_test_in_friendship);
        nrf_mesh_keygen_virtual_address_ExpectAndReturn(exp_vt_addr[vt_cnt].uuid, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
        nrf_mesh_keygen_virtual_address_ReturnThruPtr_p_address(&exp_vt_addr[vt_cnt].addr);
        flash_expect_addr_virtual(exp_vt_addr[vt_cnt].uuid);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_virtual_add(exp_vt_addr[vt_cnt].uuid, &exp_vt_addr[vt_cnt].handle));

        /* Add some addresses multiple times */
        if (i % 2)
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_virtual_add(exp_vt_addr[vt_cnt].uuid, &exp_vt_addr[vt_cnt].handle));
        }
        vt_cnt++;
    }
    mesh_lpn_internal_mock_Verify();

