NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    for (uint32_t i = 0; i < nv_cnt; i++)
    {
        mesh_lpn_subman_add_ExpectAndReturn(exp_nv_addr[i].addr, NRF_SUCCESS);
    }
    for (uint32_t i = 0; i < vt_cnt; i++)
    {
        mesh_lpn_subman_add_ExpectAndReturn(exp_vt_addr[i].addr, NRF_SUCCESS);
    }

    heartbeat_subscription_state_t hb_sub = {
        .dst = 0xF000 // a group address that isn't the rx list
    };
    heartbeat_subscription_get_ExpectAndReturn(&hb_sub);
    mesh_lpn_subman_add_ExpectAndReturn(hb_sub.dst, NRF_SUCCESS);

    helper_trigger_event(NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED);
    mesh_lpn_internal_mock_Verify();

    /* Test: Once in friendship, further new additions are propagated */
    exp_nv_addr[nv_cnt].addr = 0xC000 + nv_cnt;
    flash_expect_addr_nonvirtual(exp_nv_addr[nv_cnt].addr);
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_test_in_friendship);
    mesh_lpn_subman_add_ExpectAndReturn(exp_nv_addr[nv_cnt].addr, NRF_SUCCESS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add(exp_nv_addr[nv_cnt].addr, &exp_nv_addr[nv_cnt].handle));
    nv_cnt++;

    exp_vt_addr[vt_cnt].addr = 0xA000 + vt_cnt;
    memset(exp_vt_addr[vt_cnt].uuid, vt_cnt, NRF_MESH_UUID_SIZE);

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_test_in_friendship);
    nrf_mesh_keygen_virtual_address_ExpectAndReturn(exp_vt_addr[vt_cnt].uuid, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_virtual_address_IgnoreArg_p_address();
    nrf_mesh_keygen_virtual_address_ReturnThruPtr_p_address(&exp_vt_addr[vt_cnt].addr);
    flash_expect_addr_virtual(exp_vt_addr[vt_cnt].uuid);
    mesh_lpn_subman_add_ExpectAndReturn(exp_vt_addr[vt_cnt].addr, NRF_SUCCESS);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_virtual_add(exp_vt_addr[vt_cnt].uuid, &exp_vt_addr[vt_cnt].handle));
    vt_cnt++;

    /* Test: Addresses in DSM are re-propagated if friendship is re-established */
    helper_trigger_event(NRF_MESH_EVT_FRIENDSHIP_TERMINATED);
    for (uint32_t i = 0; i < nv_cnt; i++)
    {
        mesh_lpn_subman_add_ExpectAndReturn(exp_nv_addr[i].addr, NRF_SUCCESS);
    }
    for (uint32_t i = 0; i < vt_cnt; i++)
    {
        mesh_lpn_subman_add_ExpectAndReturn(exp_vt_addr[i].addr, NRF_SUCCESS);
    }
    hb_sub.dst = 0x0001; // a valid unicast addr, shouldn't be added to the subman
    heartbeat_subscription_get_ExpectAndReturn(&hb_sub);

    helper_trigger_event(NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED);


    /* Test: Once in friendship, duplicate additions are ignored */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_add(exp_nv_addr[0].addr, &exp_nv_addr[0].handle));
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_virtual_add(exp_vt_addr[vt_cnt-1].uuid, &exp_vt_addr[vt_cnt-1].handle));

    /* Test: Once in friendship, removals are propagated */
    uint16_t count;
    for (uint32_t i = 0; i < nv_cnt; i++)
    {
        do
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(exp_nv_addr[i].handle, &count));
            if (count == 1)
            {
                flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_NONVIRTUAL, exp_nv_addr[i].handle));
                mesh_lpn_is_in_friendship_ExpectAndReturn(m_test_in_friendship);
                mesh_lpn_subman_remove_ExpectAndReturn(exp_nv_addr[i].addr, NRF_SUCCESS);
            }
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_remove(exp_nv_addr[i].handle));
        } while (count > 1);
    }

    for (uint32_t i = 0; i < vt_cnt; i++)
    {
        do
        {
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_count_get(exp_vt_addr[i].handle, &count));
            if (count == 1)
            {
                flash_invalidate_expect(DSM_HANDLE_TO_FLASH_HANDLE(DSM_FLASH_GROUP_ADDR_VIRTUAL, exp_vt_addr[i].handle - DSM_NONVIRTUAL_ADDR_MAX));
                mesh_lpn_is_in_friendship_ExpectAndReturn(m_test_in_friendship);
                mesh_lpn_subman_remove_ExpectAndReturn(exp_vt_addr[i].addr, NRF_SUCCESS);
            }
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_subscription_remove(exp_vt_addr[i].handle));
        } while (count > 1);
    }

    helper_trigger_event(NRF_MESH_EVT_FRIENDSHIP_TERMINATED);
}


void test_getters(void)
{
    /* Add some dummy networks */
    struct
    {
        dsm_handle_t handle;
        nrf_mesh_network_secmat_t secmat;
        nrf_mesh_beacon_secmat_t beacon_secmat;
    } net[3];
    uint8_t key[NRF_MESH_KEY_SIZE] = {};
    for (uint32_t i = 0; i < ARRAY_SIZE(net); i++)
    {
        memset(net[i].secmat.privacy_key, i, NRF_MESH_KEY_SIZE);
        memset(net[i].secmat.encryption_key, i + 0x10, NRF_MESH_KEY_SIZE);
        memset(net[i].beacon_secmat.key, i + 0x20, NRF_MESH_KEY_SIZE);
        memset(net[i].beacon_secmat.net_id, i + 0x30, NRF_MESH_NETID_SIZE);
        net[i].secmat.nid = i;
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&net[i].secmat, sizeof(net[i].secmat));
        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&net[i].beacon_secmat, sizeof(net[i].beacon_secmat));
        flash_expect_subnet(key, i);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(i, key, &net[i].handle));

        uint16_t index = 0xffff;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_handle_to_netkey_index(net[i].handle, &index));
        TEST_ASSERT_EQUAL(i, index);
    }
    /* Add some dummy apps */
    struct
    {
        dsm_handle_t handle;
        uint8_t aid;
    } app[6];
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_keygen_aid_ExpectAndReturn(key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_aid_IgnoreArg_p_aid();
        nrf_mesh_keygen_aid_ReturnMemThruPtr_p_aid(&app[i].aid, sizeof(app[i].aid));
        flash_expect_appkey(key, i, net[i / 2].handle);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_add(i, net[i / 2].handle, key, &app[i].handle));
    }

    /* Add some dummy friendships */
    struct
    {
        mesh_key_index_t key_index;
        dsm_handle_t subnet_handle;
        nrf_mesh_keygen_friendship_secmat_params_t secmat_params;
        nrf_mesh_network_secmat_t secmat;
    } friendships[] =
    {
        {0, 0, {0x0001, 0x0002, 1, 2}, {0, {0xAA}, {0xBB}}},
    };
    for (uint32_t i = 0; i < ARRAY_SIZE(friendships); i++)
    {
        const nrf_mesh_network_secmat_t *p_net_secmat_valid;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(friendships[i].key_index, &p_net_secmat_valid));

        nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(key, &friendships[i].secmat_params, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&friendships[i].secmat, sizeof(nrf_mesh_network_secmat_t));

        TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid, &friendships[i].secmat_params));
    }

    for (uint32_t i = 0; i < ARRAY_SIZE(net); i++)
    {
        TEST_ASSERT_EQUAL(net[i].handle, dsm_net_key_index_to_subnet_handle(i));
    }
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_secmat_t secmat;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));
        TEST_ASSERT_NOT_NULL(secmat.p_net);
        TEST_ASSERT_EQUAL(net[i/2].handle, dsm_subnet_handle_get(secmat.p_net));
        TEST_ASSERT_NOT_NULL(secmat.p_app);
        TEST_ASSERT_EQUAL(app[i].handle, dsm_appkey_handle_get(secmat.p_app));

        TEST_ASSERT_EQUAL(app[i].handle, dsm_appkey_index_to_appkey_handle(i));

        uint16_t index = 0xffff;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_appkey_handle_to_appkey_index(i, &index));
        TEST_ASSERT_EQUAL(i, index);

        /* Also get tx secmat for friendship */
        for (uint32_t j = 0; j < ARRAY_SIZE(friendships); j++)
        {
            if (friendships[j].subnet_handle == net[i / 2].handle)
            {
                TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_friendship_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));
                TEST_ASSERT_NOT_NULL(secmat.p_net);
                TEST_ASSERT_EQUAL(friendships[j].subnet_handle, dsm_subnet_handle_get(secmat.p_net));
            }
        }
    }

    /* invalid params */
    TEST_ASSERT_EQUAL(DSM_HANDLE_INVALID, dsm_appkey_handle_get(NULL));
    TEST_ASSERT_EQUAL(DSM_HANDLE_INVALID, dsm_subnet_handle_get(NULL));
    TEST_ASSERT_EQUAL(DSM_HANDLE_INVALID, dsm_net_key_index_to_subnet_handle(DSM_HANDLE_INVALID));
    TEST_ASSERT_EQUAL(DSM_HANDLE_INVALID, dsm_appkey_index_to_appkey_handle(DSM_HANDLE_INVALID));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, dsm_appkey_handle_to_appkey_index(0, NULL));
    TEST_ASSERT_EQUAL(NRF_ERROR_NULL, dsm_subnet_handle_to_netkey_index(0, NULL));

    uint16_t testvar;
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_appkey_handle_to_appkey_index(DSM_HANDLE_INVALID, &testvar));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_handle_to_netkey_index(DSM_HANDLE_INVALID, &testvar));
}

