NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(network_handle, &current_phase));
    TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_0, current_phase);

    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, dsm_subnet_update_commit(network_handle));
    TEST_ASSERT_EQUAL(NRF_ERROR_INVALID_STATE, dsm_subnet_update_swap_keys(network_handle));

    /* In key refresh phase 3, only new keys should be used for transmitting packets: */
    for (uint32_t i = 0; i < ARRAY_SIZE(app); i++)
    {
        nrf_mesh_secmat_t secmat;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_tx_secmat_get(DSM_HANDLE_INVALID, app[i].handle, &secmat));

        /* Verify application secmat: */
        if (i == 0 || i == 1)
        {
            TEST_ASSERT_EQUAL_HEX8(new_aid, secmat.p_app->aid);
            TEST_ASSERT_EQUAL_HEX8_ARRAY(new_appkey, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        }
        else
        {
            TEST_ASSERT_EQUAL_HEX8(app[i].aid, secmat.p_app->aid);
            TEST_ASSERT_EQUAL_HEX8_ARRAY(app[i].key, secmat.p_app->key, NRF_MESH_KEY_SIZE);
        }

        /* Verify network secmat: */
        TEST_ASSERT_EQUAL_HEX8_ARRAY(new_secmat.encryption_key, secmat.p_net->encryption_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8_ARRAY(new_secmat.privacy_key, secmat.p_net->privacy_key, NRF_MESH_KEY_SIZE);
        TEST_ASSERT_EQUAL_HEX8(new_secmat.nid, secmat.p_net->nid);
    }

    /* Check that the new NID can be used to receive packets: */
    mesh_lpn_is_in_friendship_IgnoreAndReturn(m_test_in_friendship);
    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NOT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);

    memset(expected_key, 11, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->privacy_key, NRF_MESH_KEY_SIZE);
    memset(expected_key, 22, NRF_MESH_KEY_SIZE);
    TEST_ASSERT_EQUAL_HEX8_ARRAY(expected_key, p_primary->encryption_key, NRF_MESH_KEY_SIZE);
    mesh_lpn_is_in_friendship_IgnoreAndReturn(m_test_in_friendship);
    nrf_mesh_net_secmat_next_get(new_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);
    mesh_lpn_is_in_friendship_IgnoreAndReturn(m_test_in_friendship);
    nrf_mesh_net_secmat_next_get(old_nid, &p_primary, &p_secondary);
    TEST_ASSERT_NULL(p_primary);
    TEST_ASSERT_NULL(p_secondary);
#endif
}

void test_key_refresh_1_to_3(void)
{
    struct
    {
        dsm_handle_t network_handle;
        uint8_t old_nid;
        uint8_t new_nid;
        mesh_key_index_t key_index;
        bool is_in_friendship;
    } net[] =
    {
        {DSM_HANDLE_INVALID, 2, 18, 0, true},  /* Old and new NIDs are differenet, friendship */
        {DSM_HANDLE_INVALID, 3, 19, 1, false}, /* Old and new NIDs are differenet, no friendship */
        {DSM_HANDLE_INVALID, 4, 4,  2, true},  /* Old and new NID are the same, friendship */
        {DSM_HANDLE_INVALID, 5, 5,  3, false}, /* Old and new NID are the same, no friendship */
    };

    nrf_mesh_network_secmat_t old_secmat, new_secmat;
    nrf_mesh_beacon_secmat_t old_beacon_secmat, new_beacon_secmat;
    nrf_mesh_network_secmat_t old_friendship_secmat, new_friendship_secmat;

    const uint8_t old_key[NRF_MESH_KEY_SIZE] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16 };
    const uint8_t new_key[NRF_MESH_KEY_SIZE] = { 16, 15, 14, 13, 12, 11, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1 };

    nrf_mesh_keygen_friendship_secmat_params_t friendship_secmat_params = {0x0001, 0x0002, 1, 2};

    const nrf_mesh_network_secmat_t * p_test_secmat = NULL;
    const nrf_mesh_network_secmat_t * p_test_aux_secmat = NULL;

    /* Add the original network key, which will be refreshed: */
    memset(old_secmat.privacy_key,    1, NRF_MESH_KEY_SIZE);
    memset(old_secmat.encryption_key, 2, NRF_MESH_KEY_SIZE);
    memset(new_secmat.privacy_key,    11, NRF_MESH_KEY_SIZE);
    memset(new_secmat.encryption_key, 22, NRF_MESH_KEY_SIZE);
    memset(old_beacon_secmat.key,     3, NRF_MESH_KEY_SIZE);
    memset(old_beacon_secmat.net_id,  4, NRF_MESH_NETID_SIZE);
    memset(new_beacon_secmat.key,    33, NRF_MESH_KEY_SIZE);
    memset(new_beacon_secmat.net_id, 44, NRF_MESH_NETID_SIZE);
    memset(old_friendship_secmat.privacy_key,    5, NRF_MESH_KEY_SIZE);
    memset(old_friendship_secmat.encryption_key, 6, NRF_MESH_KEY_SIZE);
    memset(new_friendship_secmat.privacy_key,    55, NRF_MESH_KEY_SIZE);
    memset(new_friendship_secmat.encryption_key, 66, NRF_MESH_KEY_SIZE);

    /* Test API functions on non-existent keys: */
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update(0, new_key));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update_swap_keys(0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_subnet_update_commit(0));
    TEST_ASSERT_EQUAL(NRF_ERROR_NOT_FOUND, dsm_appkey_update(0, new_key));

    for (uint32_t i = 0; i < ARRAY_SIZE(net); i++)
    {
        old_secmat.nid = net[i].old_nid;
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(old_key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&old_secmat, sizeof(old_secmat));
        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(old_key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&old_beacon_secmat, sizeof(old_beacon_secmat));
        flash_expect_subnet(old_key, net[i].key_index);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_add(net[i].key_index, old_key, &net[i].network_handle));

        if (net[i].is_in_friendship)
        {
            const nrf_mesh_network_secmat_t *p_net_secmat_valid;
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(net[i].key_index, &p_net_secmat_valid));

            old_friendship_secmat.nid = net[i].old_nid;
            nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(old_key, &friendship_secmat_params, NULL, NRF_SUCCESS);
            nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
            nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&old_friendship_secmat, sizeof(nrf_mesh_network_secmat_t));

            TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid, &friendship_secmat_params));
        }

        /* Check secmat */
        p_test_secmat = NULL;
        p_test_aux_secmat = NULL;

        /* If in friendship, don't expect mesh_lpn_is_in_friendship() since friendship and regular
         * secmats have same NID, otherwise expect it. */
        if (!net[i].is_in_friendship)
        {
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
        }

        nrf_mesh_net_secmat_next_get(net[i].old_nid, &p_test_secmat, &p_test_aux_secmat);
        TEST_ASSERT_NULL(p_test_aux_secmat);
        if (!net[i].is_in_friendship)
        {
            TEST_ASSERT_EQUAL_HEX8_ARRAY(&old_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));

            /* This time it should fail. */
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
            nrf_mesh_net_secmat_next_get(net[i].old_nid, &p_test_secmat, &p_test_aux_secmat);

            TEST_ASSERT_NULL(p_test_secmat);
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }
        else
        {
            TEST_ASSERT_EQUAL_HEX8_ARRAY(&old_friendship_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));

            /* We've added both friendship and normal secmat with same NID. I.e., the second time it
             * should return null, as LPN should not process packets arriving on the normal (master) secmat: */
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
            nrf_mesh_net_secmat_next_get(net[i].old_nid, &p_test_secmat, &p_test_aux_secmat);
            TEST_ASSERT_NULL(p_test_secmat);
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }

        nrf_mesh_key_refresh_phase_t current_phase;
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(net[i].network_handle, &current_phase));
        TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_0, current_phase);

        /* Start the key update procedure (go to KR phase 1): */
        new_secmat.nid = net[i].new_nid;
        nrf_mesh_keygen_network_secmat_ExpectAndReturn(new_key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&new_secmat, sizeof(new_secmat));
        net_state_key_refresh_phase_changed_Expect(net[i].key_index, new_beacon_secmat.net_id, NRF_MESH_KEY_REFRESH_PHASE_1);
        nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(new_key, NULL, NRF_SUCCESS);
        nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
        nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&new_beacon_secmat, sizeof(new_beacon_secmat));
        if (net[i].is_in_friendship)
        {
            new_friendship_secmat.nid = net[i].new_nid;
            nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(new_key, &friendship_secmat_params, NULL, NRF_SUCCESS);
            nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
            nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&new_friendship_secmat, sizeof(nrf_mesh_network_secmat_t));
        }
        flash_expect_subnet_update(old_key, new_key, net[i].key_index, NRF_MESH_KEY_REFRESH_PHASE_1, net[i].network_handle);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update(net[i].network_handle, new_key));

        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(net[i].network_handle, &current_phase));
        TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_1, current_phase);

        /* Check secmats */
        p_test_secmat = NULL;
        p_test_aux_secmat = NULL;

        /* If in friendship, don't expect mesh_lpn_is_in_friendship() since friendship and regular
         * secmats have same NID, otherwise expect it. */
        if (!net[i].is_in_friendship)
        {
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
        }

        nrf_mesh_net_secmat_next_get(net[i].new_nid, &p_test_secmat, &p_test_aux_secmat);
        if (!net[i].is_in_friendship)
        {
            /* If old and new NID are the same, both secmats shall be returned */
            if (net[i].old_nid == net[i].new_nid)
            {
                TEST_ASSERT_EQUAL_HEX8_ARRAY(&old_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));
                TEST_ASSERT_EQUAL_HEX8_ARRAY(&new_secmat, p_test_aux_secmat, sizeof(nrf_mesh_network_secmat_t));
            }
            else
            {
                TEST_ASSERT_NULL(p_test_aux_secmat);
            }

            /* This time it should fail. */
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
            nrf_mesh_net_secmat_next_get(net[i].old_nid, &p_test_secmat, &p_test_aux_secmat);
            TEST_ASSERT_NULL(p_test_secmat);
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }
        else /* is_in_friendship */
        {
            /* If old and new NID are the same, Both secmats shall be returned */
            if (net[i].old_nid == net[i].new_nid)
            {
                TEST_ASSERT_EQUAL_HEX8_ARRAY(&old_friendship_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));
                TEST_ASSERT_EQUAL_HEX8_ARRAY(&new_friendship_secmat, p_test_aux_secmat, sizeof(nrf_mesh_network_secmat_t));
            }
            else
            {
                TEST_ASSERT_NULL(p_test_aux_secmat);
            }

            /* We've added both friendship and normal secmat with same NID. I.e., the second time it
             * should return null, as LPN should not process packets arriving on the normal (master) secmat: */
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
            nrf_mesh_net_secmat_next_get(net[i].old_nid, &p_test_secmat, &p_test_aux_secmat);
            TEST_ASSERT_NULL(p_test_secmat);
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }


