NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
        /* When key refresh process is in progress, nrf_mesh_friendship_secmat_params_set() call
         * shall generate friendship secmats according to the new network key */
        if (net[i].is_in_friendship)
        {
            /* Remove friendship creds */
            nrf_mesh_evt_t mesh_friendship_terminated_evt;
            mesh_friendship_terminated_evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
            mesh_friendship_terminated_evt.params.friendship_terminated.lpn_src = friendship_secmat_params.lpn_address;
            mesh_friendship_terminated_evt.params.friendship_terminated.friend_src = friendship_secmat_params.friend_address;
            m_mesh_evt_handler.evt_cb(&mesh_friendship_terminated_evt);

            /* Re-add friendship creds again. They shall be created using new network key. */
            const nrf_mesh_network_secmat_t *p_net_secmat_valid;
            TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(net[i].key_index, &p_net_secmat_valid));

            new_friendship_secmat.nid = net[i].new_nid;
            nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(new_key, &friendship_secmat_params, NULL, NRF_SUCCESS);
            nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
            nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&new_friendship_secmat, sizeof(nrf_mesh_network_secmat_t));

            TEST_ASSERT_EQUAL(NRF_SUCCESS, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid, &friendship_secmat_params));

            /* Check secmats */
            p_test_secmat = NULL;
            p_test_aux_secmat = NULL;

            nrf_mesh_net_secmat_next_get(net[i].new_nid, &p_test_secmat, &p_test_aux_secmat);

            /* Only one secmat shall be returned */
            TEST_ASSERT_EQUAL_HEX8_ARRAY(&new_friendship_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }

        /* Skip phase 2 and go directly to phase 3 (which goes immediately to phase 0 again): */
        net_state_key_refresh_phase_changed_Expect(net[i].key_index, new_beacon_secmat.net_id, NRF_MESH_KEY_REFRESH_PHASE_0);
        flash_expect_subnet(new_key, net[i].key_index);
        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update_commit(net[i].network_handle));

        TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_kr_phase_get(net[i].network_handle, &current_phase));
        TEST_ASSERT_EQUAL(NRF_MESH_KEY_REFRESH_PHASE_0, current_phase);

        /* Check secmats again */
        p_test_secmat = NULL;
        p_test_aux_secmat = NULL;

        /* If in friendship, don't expect mesh_lpn_is_in_friendship() since friendship and regular
         * secmats have same NID, otherwise expect it. */
        if (!net[i].is_in_friendship)
        {
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
        }

        nrf_mesh_net_secmat_next_get(net[i].new_nid, &p_test_secmat, &p_test_aux_secmat);
        TEST_ASSERT_NOT_NULL(p_test_secmat);
        TEST_ASSERT_NULL(p_test_aux_secmat);

        if (!net[i].is_in_friendship)
        {
            TEST_ASSERT_EQUAL_HEX8_ARRAY(&new_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));

            /* This time it should fail. */
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
            nrf_mesh_net_secmat_next_get(net[i].new_nid, &p_test_secmat, &p_test_aux_secmat);
            TEST_ASSERT_NULL(p_test_secmat);
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }
        else
        {
            TEST_ASSERT_EQUAL_HEX8_ARRAY(&new_friendship_secmat, p_test_secmat, sizeof(nrf_mesh_network_secmat_t));

            /* We've added both friendship and normal secmat with same NID. I.e., the second time it
             * should return null, as LPN should not process packets arriving on the normal (master) secmat: */
            mesh_lpn_is_in_friendship_ExpectAndReturn(net[i].is_in_friendship);
            nrf_mesh_net_secmat_next_get(net[i].new_nid, &p_test_secmat, &p_test_aux_secmat);
            TEST_ASSERT_NULL(p_test_secmat);
            TEST_ASSERT_NULL(p_test_aux_secmat);
        }


#if MESH_FEATURE_LPN_ENABLED
        /* Remove current friendship credentials to be able to add a new one when LPN feature is enabled */
        if (net[i].is_in_friendship)
        {
            nrf_mesh_evt_t mesh_friendship_terminated_evt;
            mesh_friendship_terminated_evt.type = NRF_MESH_EVT_FRIENDSHIP_TERMINATED;
            mesh_friendship_terminated_evt.params.friendship_terminated.lpn_src = friendship_secmat_params.lpn_address;
            mesh_friendship_terminated_evt.params.friendship_terminated.friend_src = friendship_secmat_params.friend_address;
            m_mesh_evt_handler.evt_cb(&mesh_friendship_terminated_evt);
        }
#endif
        mesh_lpn_mock_Verify();
    }
}

void test_flash_load(void)
{
    flash_manager_add_StubWithCallback(NULL); /* want custom checking on this */
    uint32_t metainfo_size = sizeof(dsm_flash_entry_metainfo_t);
    flash_read_expect(DSM_FLASH_HANDLE_METAINFO, NULL, &metainfo_size);
    TEST_ASSERT_FALSE(dsm_flash_config_load());

    /* Gradually add more entries until we get an acceptable flash config */

    dsm_entry_t metainfo;

    metainfo.entry.metainfo.max_subnets = DSM_SUBNET_MAX - 1; /* invalid! */
    metainfo.entry.metainfo.max_appkeys = DSM_APP_MAX;
    metainfo.entry.metainfo.max_devkeys = DSM_DEVICE_MAX;
    metainfo.entry.metainfo.max_addrs_virtual = DSM_VIRTUAL_ADDR_MAX;
    metainfo.entry.metainfo.max_addrs_nonvirtual = DSM_NONVIRTUAL_ADDR_MAX;

    /* Fail resetting the flash manager */
    flash_read_expect(DSM_FLASH_HANDLE_METAINFO, &metainfo, &metainfo_size);
    flash_manager_remove_IgnoreAndReturn(NRF_ERROR_NO_MEM);
    flash_manager_mem_listener_register_StubWithCallback(flash_manager_mem_listener_register_cb);
    m_fm_mem_listener_register_expect = 1;
    TEST_ASSERT_FALSE(dsm_flash_config_load());
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);
    TEST_ASSERT_NOT_NULL(mp_mem_listener);
    /* recover from the failure to reset */
    flash_manager_remove_ExpectAndReturn(mp_flash_manager, NRF_SUCCESS);
    mp_mem_listener->callback(mp_mem_listener->p_args); /* should call remove */
    flash_manager_mock_Verify();
    /* fail adding */
    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    flash_manager_add_ExpectAndReturn(mp_flash_manager,
                                      &mp_flash_manager->config,
                                      NRF_ERROR_NO_MEM);
    m_fm_mem_listener_register_expect = 1;
    mp_flash_manager->config.remove_complete_cb(mp_flash_manager);
    TEST_ASSERT_EQUAL(0, m_fm_mem_listener_register_expect);

    /* notify about more memory, and succeed all calls this time. */
    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    flash_manager_add_ExpectAndReturn(mp_flash_manager,
                                      &mp_flash_manager->config,
                                      NRF_SUCCESS);
    mp_flash_manager->internal.state = FM_STATE_BUILDING;
    flash_expect_metainfo();
    mp_mem_listener->callback(mp_mem_listener->p_args);


    /* Run again, but this time, succeed resetting. */
    flash_read_expect(DSM_FLASH_HANDLE_METAINFO, &metainfo, &metainfo_size);
    flash_manager_remove_IgnoreAndReturn(NRF_SUCCESS);
    TEST_ASSERT_FALSE(dsm_flash_config_load());
    flash_manager_mock_Verify();

    net_state_flash_area_get_ExpectAndReturn((void *)(PAGE_SIZE + (uint32_t)m_flash_area));
    flash_manager_add_ExpectAndReturn(mp_flash_manager,
                                      &mp_flash_manager->config,
                                      NRF_SUCCESS);
    flash_expect_metainfo();
    mp_flash_manager->config.remove_complete_cb(mp_flash_manager);

    metainfo.entry.metainfo.max_subnets = DSM_SUBNET_MAX; /* valid */
    flash_manager_mock_Verify();

