NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    /* This should just bump the alloc counter. */
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_publish_add(raw_addresses[1], &handles[0]));

    dsm_handle_t stored_handles[1];
    uint32_t count = 1;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_address_get_all(stored_handles, &count));
    TEST_ASSERT_EQUAL(1, count);
    TEST_ASSERT_EQUAL_UINT16_ARRAY(handles, stored_handles, count);
#if TEST_EXPLICIT_ORDERING
    /* We use our superpowers to know that the virtual addresses start after the end of the non-virtuals. */
    const dsm_handle_t expected_handles[1] = {0};
    TEST_ASSERT_EQUAL_UINT16_ARRAY(expected_handles, stored_handles, 1);
#endif
}

void test_lpn_request_timeout_handling(void)
{
    const uint8_t NID = 0x42;
    test_net_t nets;
    memset(&nets, 0, sizeof(nets));

    nrf_mesh_network_secmat_t friendship_secmat = {
        .nid = NID,
        .privacy_key = {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F},
        .encryption_key = {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F},
    };

    /* Dummy parameters, not important in this test. */
    nrf_mesh_keygen_friendship_secmat_params_t friendship_secmat_params = {
        .lpn_address = 0x002a,
        .friend_address = 0x0002,
        .lpn_counter = 1,
        .friend_counter = 2
    };

    nets.key_index = 0;
    nets.nid = NID;
    memset(nets.key, 0x55, NRF_MESH_KEY_SIZE);
    nets.handle = 0xBEEF;
    network_add(&nets);

    friendship_network_add(&nets, &friendship_secmat_params, &friendship_secmat);

    dsm_local_unicast_address_t self_address = {friendship_secmat_params.lpn_address, 1};
    flash_expect_unicast(&self_address);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_local_unicast_addresses_set(&self_address));

    const nrf_mesh_network_secmat_t * p_get_net_secmat;
    nrf_mesh_friendship_secmat_get(friendship_secmat_params.lpn_address, &p_get_net_secmat);
    TEST_ASSERT_EQUAL_MEMORY(&friendship_secmat, p_get_net_secmat, sizeof(nrf_mesh_network_secmat_t));

    helper_trigger_event(NRF_MESH_EVT_LPN_FRIEND_REQUEST_TIMEOUT);

    p_get_net_secmat = NULL;
    nrf_mesh_friendship_secmat_get(friendship_secmat_params.lpn_address, &p_get_net_secmat);
    TEST_ASSERT_NULL(p_get_net_secmat);
}

void test_friendship_secmat_overflow(void)
{
#if MESH_FEATURE_LPN_ENABLED && MESH_FEATURE_FRIEND_ENABLED
    #define MESH_FRIENDSHIP_CREDENTIALS (MESH_FRIEND_FRIENDSHIP_COUNT + 1)
#elif MESH_FEATURE_LPN_ENABLED
    #define MESH_FRIENDSHIP_CREDENTIALS  1
#elif MESH_FEATURE_FRIEND_ENABLED
    #define MESH_FRIENDSHIP_CREDENTIALS (MESH_FRIEND_FRIENDSHIP_COUNT)
#endif

    test_net_t nets[MESH_FRIENDSHIP_CREDENTIALS];
    memset(nets, 0, sizeof(nets));

    nrf_mesh_network_secmat_t friendship_secmat = {
        .privacy_key = {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F},
        .encryption_key = {0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B, 0x0C, 0x0D, 0x0E, 0x0F},
    };

    /* Dummy parameters, not important in this test. */
    nrf_mesh_keygen_friendship_secmat_params_t friendship_secmat_params = {
        .lpn_address = 0x0001,
        .friend_address = 0x0002,
        .lpn_counter = 1,
        .friend_counter = 2
    };

    for (uint32_t i = 0; i < ARRAY_SIZE(nets); ++i)
    {
        friendship_secmat.nid = i + 2;

        nets[i].key_index = i;
        nets[i].nid = friendship_secmat.nid;
        memset(nets[i].key, i, NRF_MESH_KEY_SIZE);
        nets[i].handle = 0xBEEF;

        network_add(&nets[i]);

        friendship_network_add(nets, &friendship_secmat_params, &friendship_secmat);
    }

    const uint8_t nid = 0x2a;
    test_net_t one_more_net;
    memset(&one_more_net, 0, sizeof(one_more_net));

    friendship_secmat.nid = nid;
    one_more_net.key_index = 0x2a;
    one_more_net.nid = friendship_secmat.nid;
    memset(one_more_net.key, 0x2a, NRF_MESH_KEY_SIZE);
    one_more_net.handle = 0xDEAD;

    network_add(&one_more_net);

    const nrf_mesh_network_secmat_t * p_net_secmat_valid;
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_net_secmat_from_keyindex_get(one_more_net.key_index, &p_net_secmat_valid));
    TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, nrf_mesh_friendship_secmat_params_set(p_net_secmat_valid, &friendship_secmat_params));
}

void test_key_refresh_phase_get(void)
{
    test_net_t network;
    memset(&network, 0, sizeof(network));
    network.key_index = 1;
    network.nid = 0x1e;
    memset(network.key, 0x1e, NRF_MESH_KEY_SIZE);
    network.handle = 0xABCD;
    network_add(&network);

    test_net_t new_network;
    memset(&new_network, 0, sizeof(new_network));
    new_network.key_index = 1;
    new_network.nid = 33;
    memset(new_network.key, 0xab, NRF_MESH_KEY_SIZE);
    memset(new_network.secmat.net.privacy_key,    11, NRF_MESH_KEY_SIZE);
    memset(new_network.secmat.net.encryption_key, 22, NRF_MESH_KEY_SIZE);
    new_network.secmat.net.nid = 33;

    new_network.handle = network.handle;

    nrf_mesh_keygen_friendship_secmat_params_t friendship_secmat_params = {
      .lpn_address = 0x1337,
      .friend_address = 0x0001,
      .lpn_counter = 52,
      .friend_counter = 13
    };
    nrf_mesh_network_secmat_t friend_secmat;
    memset(&friend_secmat, 0, sizeof(friend_secmat));
    friend_secmat.nid = 13;
    memset(friend_secmat.encryption_key, 0x13, NRF_MESH_KEY_SIZE);
    memset(friend_secmat.privacy_key, 0x13, NRF_MESH_KEY_SIZE);
    friendship_network_add(&network, &friendship_secmat_params, &friend_secmat);

    nrf_mesh_network_secmat_t new_friend_secmat;
    memset(&new_friend_secmat, 0, sizeof(new_friend_secmat));
    new_friend_secmat.nid = 14;
    memset(new_friend_secmat.encryption_key, 0x14, NRF_MESH_KEY_SIZE);
    memset(new_friend_secmat.privacy_key, 0x14, NRF_MESH_KEY_SIZE);

    subnet_key_refresh_phase_Verify(network.handle, NRF_MESH_KEY_REFRESH_PHASE_0);

    mesh_lpn_is_in_friendship_IgnoreAndReturn(m_test_in_friendship);
    nid_key_refresh_phase_Verify(network.nid, NRF_MESH_KEY_REFRESH_PHASE_0);

    nid_key_refresh_phase_Verify(friend_secmat.nid, NRF_MESH_KEY_REFRESH_PHASE_0);

    /* Initiate the key refresh by updating the network key: */
    nrf_mesh_keygen_network_secmat_ExpectAndReturn(new_network.key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_network_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_network_secmat_ReturnMemThruPtr_p_secmat(&new_network.secmat.net, sizeof(nrf_mesh_network_secmat_t));

