NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_device_state_manager.c
    nrf_mesh_keygen_beacon_secmat_ExpectAndReturn(new_network.key, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_beacon_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_beacon_secmat_ReturnMemThruPtr_p_secmat(&new_network.secmat.beacon, sizeof(nrf_mesh_beacon_secmat_t));

    nrf_mesh_keygen_friendship_secmat_ExpectAndReturn(new_network.key, &friendship_secmat_params, NULL, NRF_SUCCESS);
    nrf_mesh_keygen_friendship_secmat_IgnoreArg_p_secmat();
    nrf_mesh_keygen_friendship_secmat_ReturnMemThruPtr_p_secmat(&new_friend_secmat, sizeof(nrf_mesh_network_secmat_t));

    flash_expect_subnet_update(network.key, new_network.key, network.key_index, NRF_MESH_KEY_REFRESH_PHASE_1, network.handle);
    net_state_key_refresh_phase_changed_Expect(network.key_index, new_network.secmat.beacon.net_id, NRF_MESH_KEY_REFRESH_PHASE_1);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update(network.handle, new_network.key));

    subnet_key_refresh_phase_Verify(network.handle, NRF_MESH_KEY_REFRESH_PHASE_1);
    nid_key_refresh_phase_Verify(network.nid, NRF_MESH_KEY_REFRESH_PHASE_1);
    nid_key_refresh_phase_Verify(new_network.nid, NRF_MESH_KEY_REFRESH_PHASE_1);
    nid_key_refresh_phase_Verify(friend_secmat.nid, NRF_MESH_KEY_REFRESH_PHASE_1);
    nid_key_refresh_phase_Verify(new_friend_secmat.nid, NRF_MESH_KEY_REFRESH_PHASE_1);
    friendship_key_refresh_phase_Verify(friendship_secmat_params.lpn_address, NRF_MESH_KEY_REFRESH_PHASE_1);

    /* Swap the keys. */
    net_state_key_refresh_phase_changed_Expect(network.key_index, new_network.secmat.beacon.net_id, NRF_MESH_KEY_REFRESH_PHASE_2);
    flash_expect_subnet_update(network.key, new_network.key, network.key_index, NRF_MESH_KEY_REFRESH_PHASE_2, network.handle);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update_swap_keys(network.handle));

    subnet_key_refresh_phase_Verify(network.handle, NRF_MESH_KEY_REFRESH_PHASE_2);
    nid_key_refresh_phase_Verify(network.nid, NRF_MESH_KEY_REFRESH_PHASE_2);
    nid_key_refresh_phase_Verify(new_network.nid, NRF_MESH_KEY_REFRESH_PHASE_2);
    nid_key_refresh_phase_Verify(friend_secmat.nid, NRF_MESH_KEY_REFRESH_PHASE_2);
    nid_key_refresh_phase_Verify(new_friend_secmat.nid, NRF_MESH_KEY_REFRESH_PHASE_2);
    friendship_key_refresh_phase_Verify(friendship_secmat_params.lpn_address, NRF_MESH_KEY_REFRESH_PHASE_2);

    net_state_key_refresh_phase_changed_Expect(network.key_index, new_network.secmat.beacon.net_id, NRF_MESH_KEY_REFRESH_PHASE_0);
    flash_expect_subnet(new_network.key, new_network.key_index);
    TEST_ASSERT_EQUAL(NRF_SUCCESS, dsm_subnet_update_commit(network.handle));
}
